import React, { Component } from "react";
import style from "../SectionRecomend/Section_Weather.module.css";
import image from "../../image/cornwall.jpg";

export default class Section_Weather extends Component {
  render() {
    return (
      <div className={style.contianer} id='section2'>
        <div className={style.header}>
          <h2 style={{ fontWeight: "bold", color: "#fff" }}>
            ฤดูการผลิตข้าวโพดเลี้ยงสัตว์
          </h2>
        </div>
        <div className={style.content}>
          <img 
            src={image}
            style={{
              width: "40%",
              height: "auto",
              borderRadius: 10,
              marginRight: "2em",
            }}
          />
          <div className={style.contentRight}>
            <p style={{ fontSize: 18 }}>
              ข้าวโพดเลี้ยงสัตว์เป็นพืชไร่ที่ปลูกและดูแลง่าย
              หากเพียงมีแหล่งน้ำเพียงพอ สามารถปลูกข้าวโพดได้ตลอดทั้งปี
              เกษตรกรส่วนใหญ่นิยมปลูกข้าวโพดเลี้ยงสัตว์โดยอาศัยน้ำฝนธรรมชาติเป็นหลัก
              ฤดูปลูกข้าวโพดเลี้ยงสัตว์ที่เหมาะสม
              จึงขึ้นอยู่กับปริมาณน้ำฝนและการกระจายตัวของฝนในแต่ละเดือน
              โดยทั่วไป ฤดูกาลการปลูกข้าวโพดเลี้ยงสัตว์ แบ่งเป็น 2 รุ่น
              การปลูกข้าวโพดเลี้ยงสัตว์หลังนา
              ช่วงเวลาที่เหมาะสมที่สุดคือตั้งแต่เดือนพฤศจิกายน - ธันวาคม
              เพราะระยะออกดอกไม่ตรงกับช่วงอุณหภูมิสูงเกินไป
              จนเป็นอุปสรรคต่อการออกดอกและผสมเกสร
              ประกอบกับในช่วงฤดูแล้งท้องฟ้าไม่ค่อยมีเมฆมาก
              ต้นข้าวโพดเลี้ยงสัตว์มีโอกาสได้รับแสงแดดอย่างเต็มที่
              ทำให้ได้ผลผลิตสูง
            </p>
          </div>
        </div>
        <div className={style.contentWeather}>
          <h3>ข้าวโพดเลี้ยงสัตว์รุ่นที่ 1 หรือรุ่นฤดูฝน</h3>
          <p style={{ fontSize: 16 }}>
            ข้าวโพดเลี้ยงสัตว์รุ่นที่ 1 ปลูกโดยอาศัยน้ำฝนตามฤดูกาลเป็นหลัก
            แบ่งระยะการปลูกได้ 2 ช่วง คือ ปลูกช่วงต้นฤดูฝน (เมษายน - มิถุนายน)
            การปลูกข้าวโพดเลี้ยงสัตว์ในช่วงต้นฤดูฝน
            อาจจะเจอปัญหาฝนทิ้งช่วงในเดือนมิถุนายน - กรกฎาคม
            ซึ่งเป็นช่วงที่ข้าวโพดเลี้ยงสัตว์กำลังออกดอก
            หากฝนไม่ทิ้งช่วงหรือฝนตกอย่างสม่ำเสมอ
            ข้าวโพดเลี้ยงสัตว์จะให้ผลผลิตสูงกว่าการปลูกในปลายฤดูฝนประมาณร้อยละ
            20 - 25 เนื่องจากมีช่วงแสงที่ยาวนานกว่า
            แต่เสี่ยงเจอปัญหาช่วงเก็บเกี่ยวผลผลิตในเดือนสิงหาคม-กันยายน
            ซึ่งเป็นระยะเวลาที่มีฝนตกหนัก ทำให้เก็บเกี่ยวผลผลิตลำบาก
            ขณะเดียวกันฝักหรือเมล็ดข้าวโพดเลี้ยงสัตว์ที่เก็บเกี่ยวในรุ่นนี้
            มักมีความชื้นสูง เสี่ยงต่อการเข้าทำลายของเชื้อรา
            เกษตรกรส่วนใหญ่นิยมปลูกข้าวโพดเลี้ยงสัตว์ในช่วงปลายฝน (กรกฎาคม -
            สิงหาคม) เพราะไม่ค่อยเจอปัญหาฝนทิ้งช่วง
            และข้าวโพดเลี้ยงสัตว์ไม่ค่อยมีปัญหาเรื่องสารพิษอะฟลาท็อกซิน
            เพราะเก็บเกี่ยวในขณะช่วงที่มีความชื้นในอากาศตํ่า
            แต่ปัญหาที่มักพบของข้าวโพดเลี้ยงสัตว์รุ่นนี้ คือ
            เสี่ยงเจอโรคราน้ำค้างระบาด สร้างความเสียหายแก่ผลผลิต ดังนั้น
            เกษตรกรที่ปลูกข้าวโพดเลี้ยงสัตว์รุ่นนี้
            ควรเลือกสายพันธุ์ข้าวโพดเลี้ยงสัตว์ที่ต้านทานโรคราน้ำค้างได้ดี
          </p>
        </div>
        <div className={style.contentWeather}>
          <h3>ข้าวโพดเลี้ยงสัตว์รุ่นที่ 2 หรือ ข้าวโพดเลี้ยงสัตว์หลังนา</h3>
          <p style={{ fontSize: 16 }}>
            ข้าวโพดเลี้ยงสัตว์รุ่นที่ 2 เป็นการปลูกข้าวโพดเลี้ยงสัตว์ช่วงฤดูแล้ง
            ส่วนใหญ่มักปลูกในช่วงเดือนพฤศจิกายน - กุมภาพันธ์
            เก็บเกี่ยวผลผลิตในช่วงเดือนกุมภาพันธ์ - พฤษภาคม
            เกษตรกรนิยมปลูกข้าวโพดเลี้ยงสัตว์หลังนาปี โดยใช้แหล่งน้ำชลประทาน
            หรือแหล่งน้ำตามธรรมชาติ ข้อดีของข้าวโพดเลี้ยงสัตว์รุ่นนี้คือ
            ผลผลิตปลอดภัยจากปัญหาเชื้อรามากกว่า
            ข้าวโพดเลี้ยงสัตว์ที่ปลูกช่วงต้นฤดูฝน
          </p>
        </div>
      </div>
    );
  }
}
